## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.AzureFunction.azurerm_role_assignment.func_access_to_sa_blobs must be replaced
-/+ resource "azurerm_role_assignment" "func_access_to_sa_blobs" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittdatatesteuw01/providers/Microsoft.Authorization/roleAssignments/0c738f2a-00d8-9219-3190-5045245825eb" -> (known after apply)
      ~ name                                   = "0c738f2a-00d8-9219-3190-5045245825eb" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                                  = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittdatatesteuw01" -> "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittfunctesteuw01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.AzureFunction.azurerm_role_assignment.func_access_to_sa_table must be replaced
-/+ resource "azurerm_role_assignment" "func_access_to_sa_table" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittdatatesteuw01/providers/Microsoft.Authorization/roleAssignments/4228a93f-bdde-58ae-8730-d694c54cef70" -> (known after apply)
      ~ name                                   = "4228a93f-bdde-58ae-8730-d694c54cef70" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> (known after apply)
      ~ scope                                  = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittdatatesteuw01" -> "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittfunctesteuw01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.AzureFunction.azurerm_windows_function_app.fapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "fapp" {
      ~ app_settings                                   = {
          ~ "FUNCTIONS_WORKER_RUNTIME"                 = "dotnet-isolated" -> "dotnet"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"          = "true" -> null
          - "WEBSITE_RUN_FROM_PACKAGE"                 = "1" -> null
          - "WEBSITE_USE_PLACEHOLDER_DOTNETISOLATED"   = "1" -> null
            # (4 unchanged elements hidden)
        }
      ~ ftp_publish_basic_authentication_enabled       = false -> true
        id                                             = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Web/sites/fa-ecowitt-test-euw"
        name                                           = "fa-ecowitt-test-euw"
      ~ tags                                           = {
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=fd7bda94-8151-4ffd-a66c-c4a40bb82c99;IngestionEndpoint=https://westeurope-5.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=af673be2-2022-4777-8685-9fad8a6d79f3" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "fd7bda94-8151-4ffd-a66c-c4a40bb82c99" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/microsoft.insights/components/appi-ecowitt-test-euw-01" -> null
        }
      ~ webdeploy_publish_basic_authentication_enabled = false -> true
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
</details>